validationCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

                   
    
 

convertToMeters 0.001;


vertices
(
    (0.0395 0 0)	//0
    (4 0 0) //1
    (320 0 0) //2
    (320 2.82842712474619 0) //3
    (2.82842712474619 2.82842712474619 0) //4
    (0.0279307178568686 0.0279307178568686 0) //5
    (320 60 0) //6
    (2.82842712474619 60 0) //7
    (0 60 0) //8
    (0 4 0) //9
    (0 0.0395 0) //10
    (0.0395 0 300) //11
    (4 0 300) //12
    (320 0 300) //13
    (320 2.82842712474619 300) //14
    (2.82842712474619 2.82842712474619 300) //15
    (0.0279307178568686 0.0279307178568686 300) //16
    (320 60 300) //17
    (2.82842712474619 60 300) //18
    (0 60 300) //19
    (0 4 300) //20
    (0 0.0395 300) //21
    (320 -2.82842712474619 0) //22
    (2.82842712474619 -2.82842712474619 0) //23
    (0.0279307178568686 -0.0279307178568686 0) //24
    (320 -20.04 0) //25
    (2.82842712474619 -20.04 0) //26
    (0 -20.04 0) //27
    (0 -4 0) //28
    (0 -0.0395 0) //29
    (320 -2.82842712474619 300) //30
    (2.82842712474619 -2.82842712474619 300) //31
    (0.0279307178568686 -0.0279307178568686 300) //32
    (320 -20.04 300) //33
    (2.82842712474619 -20.04 300) //34
    (0 -20.04 300) //35
    (0 -4 300) //36
    (0 -0.0395 300) //37
    
);



blocks
(
    hex (5 4 9 10 16 15 20 21) (10 5 1) simpleGrading (5 1 1)
    hex (0 1 4 5 11 12 15 16) (10 5 1) simpleGrading (5 1 1)
    hex (24 23 1 0 32 31 12 11) (10 5 1) simpleGrading (5 1 1)   
    hex (29 28 23 24 37 36 31 32) (10 5 1) simpleGrading (5 1 1)
    hex (1 2 3 4 12 13 14 15) (60 5 1) simpleGrading (15 1 1)
    hex (23 22 2 1 31 30 13 12) (60 5 1) simpleGrading (15 1 1) 
    hex (4 3 6 7 15 14 17 18) (60 30 1) simpleGrading (15 5 1)
    hex (26 25 22 23 34 33 30 31) (60 30 1) simpleGrading (15 1 1)
    hex (9 4 7 8 20 15 18 19) (5 30 1) simpleGrading (1 5 1)
    hex (23 28 27 26 31 36 35 34) (5 30 1) simpleGrading (1 1 1)
);

edges
(
    arc 0 5 (0.0364932874969245 0.015115884614101 0)
    arc 5 10 (0.015115884614101 0.0364932874969245 0)
    arc 24 0 (0.0364932874969245 -0.015115884614101 0)
    arc 29 24 (0.015115884614101 -0.0364932874969245 0)
    arc 1 4 (3.69552278449868 1.53072249256719 0)
    arc 4 9 (1.53072249256719 3.69552278449868 0)
    arc 23 1 (3.69552278449868 -1.53072249256719 0)
    arc 28 23 (1.53072249256719 -3.69552278449868 0)
    arc 11 16 (0.0364932874969245 0.015115884614101 300)
    arc 16 21 (0.015115884614101 0.0364932874969245 300)
    arc 32 11 (0.0364932874969245 -0.015115884614101 300)
    arc 37 32 (0.015115884614101 -0.0364932874969245 300)
    arc 12 15 (3.69552278449868 1.53072249256719 300)
    arc 15 20 (1.53072249256719 3.69552278449868 300)
    arc 31 12 (3.69552278449868 -1.53072249256719 300)
    arc 36 31 (1.53072249256719 -3.69552278449868 300)
);

boundary
(
    left
    {
        type symmetryPlane;
        faces
        (
            (8 9 20 19)
            (9 10 21 20)
            (28 27 35 36)
	    (29 28 36 37)
        );
    }
    right
    {
        type patch;
        faces
        (
            (2 3 14 13)
            (3 6 17 14)
            (22 2 13 30)  
            (25 22 30 33)
        );
    }
    down
    {
        type wall;
        faces
        (
           (27 26 34 35)
           (26 25 33 34) 
        );
    }
    up
    {
        type patch;
        faces
        (
            (7 8 19 18)
            (6 7 18 17)
        );
    }
    hole
    {
        type wall;
        faces
        (
            (10 5 16 21)
            (5 0 11 16)
            (0 24 32 11)
            (24 29 37 32)
        );
    }
);


mergePatchPairs
(
);

// ************************************************************************* //
