validationCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    left
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          80;
        startFace       9250;
    }
    right
    {
        type            patch;
        nFaces          70;
        startFace       9330;
    }
    down
    {
        type            wall;
        inGroups        1(wall);
        nFaces          65;
        startFace       9400;
    }
    up
    {
        type            patch;
        nFaces          65;
        startFace       9465;
    }
    hole
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       9530;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          9400;
        startFace       9550;
    }
)

// ************************************************************************* //
