validationCase/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
     left
    {
        type            symmetryPlane;
    }

    right
    {
        type            calculated;
        value           $internalField;

    }

    down
    {
        type            calculated;
        value           $internalField;

    }

    up
    {
        type            calculated;
        value           $internalField;

    }

    hole
    {
        type            calculated;
        value           $internalField; 
		
    }

    defaultFaces
    {
        type            empty;
    }
    
}

// ************************************************************************* //
