validationCase/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
     left
    {
        type            symmetryPlane;
    }

    right
    {
        type            fixedValue;
        value		uniform 0;

    }

    down
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;

    }

    up
    {
        type            fixedValue;
        value		uniform 0;

    }

    hole
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;   
		
    }

    defaultFaces
    {
        type            empty;
    }
    
}

// ************************************************************************* //
