validationCase/0.orig/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{

    left
    {
        type            symmetryPlane;
    }

    right
    {
       type            zeroGradient;

    }

    down
    {
      type            fixedGradient;
	gradient	uniform 9350;

    }

    up
    {
      type            zeroGradient;

    }

    hole
    {
      type            zeroGradient;   
		
    }

    defaultFaces
    {
        type            empty;
    }

}

// ************************************************************************* //
