validationCase/0.orig/chargeDens
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      chargeDens;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 1 0 0 1 0];

internalField   uniform 0;

boundaryField
{
    left
    {
        type            symmetryPlane;
    }

    right
    {
       type            zeroGradient;

    }

    down
    {
      type            zeroGradient;

    }

    up
    {
       type            zeroGradient;

    }

    hole
    {
        type            fixedValue;
		value           uniform 1.743e-4;    
		
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
