validationCase/0.orig/elecPot
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      elecPot;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    left
    {
        type            symmetryPlane;
    }

    right
    {
       type            zeroGradient;

    }

    down
    {
        type            fixedValue;
        value           uniform 0;

    }

    up
    {
       type            zeroGradient;
    }

    hole
    {
        type            fixedValue;
        value           uniform 7540;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
