validationCase/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

   left
    {
        type            symmetryPlane;
    }

    right
    {
       type            zeroGradient;

    }

    down
    {
        type            nutkWallFunction;
        value           uniform 0;

    }

    up
    {
       type            zeroGradient;
    }

    hole
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    defaultFaces
    {
        type            empty;
    }




}


// ************************************************************************* //
